# ImportIGES

## Description
Import a 3D IGES file.

```pascal
FUNCTION ImportIGES(fileName : DYNARRAY[] of CHAR) : BOOLEAN;
```

```python

def vs.ImportIGES(fileName):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|fileName|DYNARRAY[] of CHAR|full path to the file for import|

## Returns
Return TRUE if succeeded.

## See Also
VS Functions:
ExportIGES

## Version
Availability: from Vectorworks 2014
## Category
* File I/O